package by.htp.les01.main;

public class Main {
	// 1. Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести
	// на экран
	// цифру 7, в противном случае – цифру 8.
	public static void main(String[] args) {
		double number1 = 634;
		double number2 = 432;
		if (number1 < number2) {
			System.out.println("Ответ: 7 ");
		} else {
			System.out.println("Ответ: 8 ");
		}
	}
}
