package by.htp.les01.main;

public class Main24 {

	public static void main(String[] args) {
		// 24. Составить программу, определяющую результат гадания на ромашке —
		// «любит—не любит», взяв за исходное данное количество лепестков n.

		byte n = 11;
		if (n % 2 == 0) {
			System.out.println(" Не любит ");
		} else {
			System.out.println(" Любит ");
		}
	}
}
