package by.htp.les01.main;

public class Main2 {
	public static void main(String[] args) {
		// 2. Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести
		// на экран слово «yes», в противном случае – слово «no».
		
		double number1 = 634;
		double number2 = 432;
		if (number1 > number2) {
			System.out.println(" Ответ: Yes ");
		} else {
			System.out.println(" Ответ: NO ");
		}
	}
}
